Revit 2025 API
DisplacementPathStyle Enumeration
 Used to control the graphical representation of a DisplacementPath element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum DisplacementPathStyle
Public Enumeration DisplacementPathStyle
public enum class DisplacementPathStyle
type DisplacementPathStyle
Members
Member name | Value | Description
Straight | 0 |  A single straight line is used to represent each stage of the displacement.
Jogged | 1 |  A jogged path consisting of three straight lines is used to represent each stage of the displacement.
See Also
Reference
Autodesk.Revit.DB Namespace